#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_user_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.iam.azurerm_cosmosdb_sql_role_assignment.cosmos_contributors["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"] will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.cosmos_contributors is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "cosmos_contributors" {
      - account_name        = "io-p-itn-wallet-cosno-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleAssignments/a29b664f-c483-2f11-2127-4af14d423a0b" -> null
      - name                = "a29b664f-c483-2f11-2127-4af14d423a0b" -> null
      - principal_id        = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - resource_group_name = "io-p-itn-wallet-rg-01" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01" -> null
    }

  # module.iam.azurerm_cosmosdb_sql_role_assignment.cosmos_contributors["32544b2f-b97d-4453-9555-1ad71630512c"] will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.cosmos_contributors is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "cosmos_contributors" {
      - account_name        = "io-p-itn-wallet-cosno-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleAssignments/43fc0767-e6f1-33a2-3ab5-76c9a40f1dfb" -> null
      - name                = "43fc0767-e6f1-33a2-3ab5-76c9a40f1dfb" -> null
      - principal_id        = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - resource_group_name = "io-p-itn-wallet-rg-01" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01" -> null
    }

  # module.iam.azurerm_cosmosdb_sql_role_assignment.func_app_user_staging_slot_to_cosmos_data_reader_db["db"] will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.func_app_user_staging_slot_to_cosmos_data_reader_db is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "func_app_user_staging_slot_to_cosmos_data_reader_db" {
      - account_name        = "io-p-itn-wallet-cosno-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleAssignments/aaac69c6-4477-ea38-18d9-e930359ae992" -> null
      - name                = "aaac69c6-4477-ea38-18d9-e930359ae992" -> null
      - principal_id        = "9a74d5ac-373c-4098-87ae-45a95408ec2d" -> null
      - resource_group_name = "io-p-itn-wallet-rg-01" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db" -> null
    }

  # module.iam.azurerm_cosmosdb_sql_role_assignment.func_app_user_to_cosmos_data_reader_db["db"] will be destroyed
  # (because azurerm_cosmosdb_sql_role_assignment.func_app_user_to_cosmos_data_reader_db is not in configuration)
  - resource "azurerm_cosmosdb_sql_role_assignment" "func_app_user_to_cosmos_data_reader_db" {
      - account_name        = "io-p-itn-wallet-cosno-01" -> null
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleAssignments/e58d56c2-d5dc-dd8c-0d8f-741ad9e2d88b" -> null
      - name                = "e58d56c2-d5dc-dd8c-0d8f-741ad9e2d88b" -> null
      - principal_id        = "46da34e5-f76d-4359-96bd-07e8e908f20e" -> null
      - resource_group_name = "io-p-itn-wallet-rg-01" -> null
      - role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> null
      - scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db" -> null
    }

  # module.iam.azurerm_role_assignment.cdn_blob_owners["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"] will be destroyed
  # (because azurerm_role_assignment.cdn_blob_owners is not in configuration)
  - resource "azurerm_role_assignment" "cdn_blob_owners" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/providers/Microsoft.Authorization/roleAssignments/95cf3baf-25ed-b60c-f792-dbcadc4eab4d" -> null
      - name                 = "95cf3baf-25ed-b60c-f792-dbcadc4eab4d" -> null
      - principal_id         = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name = "Storage Blob Data Owner" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" -> null
    }

  # module.iam.azurerm_role_assignment.cdn_blob_owners["32544b2f-b97d-4453-9555-1ad71630512c"] will be destroyed
  # (because azurerm_role_assignment.cdn_blob_owners is not in configuration)
  - resource "azurerm_role_assignment" "cdn_blob_owners" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/providers/Microsoft.Authorization/roleAssignments/2cc6f0f1-ef2c-4512-9c9e-777df2619167" -> null
      - name                 = "2cc6f0f1-ef2c-4512-9c9e-777df2619167" -> null
      - principal_id         = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> null
      - role_definition_name = "Storage Blob Data Owner" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" -> null
    }

  # module.iam.azurerm_role_assignment.func_app_user_slot_to_cdn_storage_account_blob_data_contributor will be destroyed
  # (because azurerm_role_assignment.func_app_user_slot_to_cdn_storage_account_blob_data_contributor is not in configuration)
  - resource "azurerm_role_assignment" "func_app_user_slot_to_cdn_storage_account_blob_data_contributor" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/providers/Microsoft.Authorization/roleAssignments/000a901a-ab70-21c0-9fb6-cb6542800bbb" -> null
      - name                 = "000a901a-ab70-21c0-9fb6-cb6542800bbb" -> null
      - principal_id         = "46da34e5-f76d-4359-96bd-07e8e908f20e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name = "Storage Blob Data Contributor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" -> null
    }

  # module.iam.azurerm_role_assignment.func_app_user_staging_slot_to_cdn_storage_account_blob_data_contributor["1"] will be destroyed
  # (because azurerm_role_assignment.func_app_user_staging_slot_to_cdn_storage_account_blob_data_contributor is not in configuration)
  - resource "azurerm_role_assignment" "func_app_user_staging_slot_to_cdn_storage_account_blob_data_contributor" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01/providers/Microsoft.Authorization/roleAssignments/7d0c4c8a-1a56-379a-29fe-12c29a6b70a4" -> null
      - name                 = "7d0c4c8a-1a56-379a-29fe-12c29a6b70a4" -> null
      - principal_id         = "9a74d5ac-373c-4098-87ae-45a95408ec2d" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> null
      - role_definition_name = "Storage Blob Data Contributor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01" -> null
    }

  # module.iam.azurerm_role_assignment.func_app_user_staging_slot_to_kv_secrets[0] will be destroyed
  # (because azurerm_role_assignment.func_app_user_staging_slot_to_kv_secrets is not in configuration)
  - resource "azurerm_role_assignment" "func_app_user_staging_slot_to_kv_secrets" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/providers/Microsoft.Authorization/roleAssignments/62bb899c-b0cf-81b6-bac4-0d111e583dc5" -> null
      - name                 = "62bb899c-b0cf-81b6-bac4-0d111e583dc5" -> null
      - principal_id         = "9a74d5ac-373c-4098-87ae-45a95408ec2d" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01" -> null
    }

  # module.iam.azurerm_role_assignment.func_app_user_to_kv_secrets will be destroyed
  # (because azurerm_role_assignment.func_app_user_to_kv_secrets is not in configuration)
  - resource "azurerm_role_assignment" "func_app_user_to_kv_secrets" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/providers/Microsoft.Authorization/roleAssignments/f76f10ac-195b-bc5e-d861-8e17a22172b4" -> null
      - name                 = "f76f10ac-195b-bc5e-d861-8e17a22172b4" -> null
      - principal_id         = "46da34e5-f76d-4359-96bd-07e8e908f20e" -> null
      - principal_type       = "ServicePrincipal" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> null
      - role_definition_name = "Key Vault Secrets User" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01" -> null
    }

  # module.iam.azurerm_role_assignment.kv_admins["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"] will be destroyed
  # (because azurerm_role_assignment.kv_admins is not in configuration)
  - resource "azurerm_role_assignment" "kv_admins" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/providers/Microsoft.Authorization/roleAssignments/da472c6b-0d8f-108a-8adf-6920712b635a" -> null
      - name                 = "da472c6b-0d8f-108a-8adf-6920712b635a" -> null
      - principal_id         = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
      - role_definition_name = "Key Vault Administrator" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01" -> null
    }

  # module.iam.azurerm_role_assignment.kv_admins["32544b2f-b97d-4453-9555-1ad71630512c"] will be destroyed
  # (because azurerm_role_assignment.kv_admins is not in configuration)
  - resource "azurerm_role_assignment" "kv_admins" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01/providers/Microsoft.Authorization/roleAssignments/a3eda041-7779-bf9d-1d05-90306157297d" -> null
      - name                 = "a3eda041-7779-bf9d-1d05-90306157297d" -> null
      - principal_id         = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
      - role_definition_name = "Key Vault Administrator" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01" -> null
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                   = "/api/v1/wallet/health"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"               = "200"
            # (19 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01"
        name                                           = "io-p-itn-wallet-supp-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                   = "/api/v1/wallet/health"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"               = "200"
            # (20 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-01|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db"
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-wallet-rg-01|io-p-itn-wallet-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.blob["iopitnwalletcdnst01|*|owner"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-01|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "32544b2f-b97d-4453-9555-1ad71630512c"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db"
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-wallet-rg-01|io-p-itn-wallet-kv-01|owner"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets Officer"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.blob["iopitnwalletcdnst01|*|owner"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_support.module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-01|db|*|reader"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "2108350b-f580-48dd-b433-966b5ddcfb44"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000001"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db"
    }

  # module.iam.module.func_app_support.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-wallet-rg-01|io-p-itn-wallet-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2108350b-f580-48dd-b433-966b5ddcfb44"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_support_slot[0].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-01|db|*|reader"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "f9d3f370-ca8c-435f-beda-f4ba156e2fb4"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000001"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db"
    }

  # module.iam.module.func_app_support_slot[0].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-wallet-rg-01|io-p-itn-wallet-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f9d3f370-ca8c-435f-beda-f4ba156e2fb4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user.module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-01|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "46da34e5-f76d-4359-96bd-07e8e908f20e"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db"
    }

  # module.iam.module.func_app_user.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-wallet-rg-01|io-p-itn-wallet-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "46da34e5-f76d-4359-96bd-07e8e908f20e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user.module.storage_account.azurerm_role_assignment.blob["iopitnwalletcdnst01|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "46da34e5-f76d-4359-96bd-07e8e908f20e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user_slot[0].module.cosmos.azurerm_cosmosdb_sql_role_assignment.this["io-p-itn-wallet-cosno-01|db|*|writer"] will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "this" {
      + account_name        = "io-p-itn-wallet-cosno-01"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "9a74d5ac-373c-4098-87ae-45a95408ec2d"
      + resource_group_name = "io-p-itn-wallet-rg-01"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01/dbs/db"
    }

  # module.iam.module.func_app_user_slot[0].module.key_vault.azurerm_role_assignment.secrets["io-p-itn-wallet-rg-01|io-p-itn-wallet-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9a74d5ac-373c-4098-87ae-45a95408ec2d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.func_app_user_slot[0].module.storage_account.azurerm_role_assignment.blob["iopitnwalletcdnst01|*|writer"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9a74d5ac-373c-4098-87ae-45a95408ec2d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 16 to add, 2 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
